export const careersData = [
  {
    id: 1,
    bio: `2023년 07월 ~ 12월 : Gloddy 스타트업 외주 개발
    - 사용자 경험 중심의 인증 시스템 구현: 사용자 인터페이스는 직관적이며 사용자 친화적인 디자인으로 구성되었고, 회원 가입, 로그인, 로그아웃, 개인 정보 수정 등의 기능을 포함한 강력한 인증 시스템을 구축했습니다. 이를 위해 보안이 강화된 API를 연동하여 사용자 데이터의 안전성을 최우선으로 고려하였습니다.
    - 통합 디자인 시스템 개발: 일관성 있는 사용자 경험을 제공하기 위해 타이포그래피, 색상 스키마, 재사용 가능한 컴포넌트 등을 포함한 확장 가능한 디자인 시스템을 개발했습니다. 이 시스템은 브랜드 가이드라인을 준수하며 개발 효율성을 높입니다.
    - 다양한 디바이스 및 OS 대응: 반응형 디자인을 적용하여 아이폰, 갤럭시 등 다양한 스마트폰과 태블릿에서 일관된 사용자 경험을 제공합니다. 크로스 브라우징 및 OS 특성을 고려한 테스트를 통해 애플리케이션의 호환성과 접근성을 보장합니다.
    - 다국어 지원: i18n 라이브러리를 활용하여 다양한 언어 사용자들도 원활한 서비스 이용이 가능하도록 다국어 지원 기능을 통합했습니다. 이를 통해 서비스의 글로벌 리치를 확대하고 다양한 문화적 배경을 가진 사용자들에게 친숙함을 제공합니다.
    - 동적 인터랙션과 애니메이션: framer-motion 라이브러리를 이용하여 사용자의 페이지 이동 및 컴포넌트 상호작용에 생동감을 더하는 세련된 애니메이션을 적용했습니다. 이는 사용자의 주의를 끌고, 애플리케이션과의 상호작용을 보다 즐겁고 흥미로운 경험으로 만듭니다.`,
  },
  {
    id: 2,
    bio: `2023년 9월 ~ 10월 : 2023월출산국화축제 외주 개발
    - 통합 개발 환경에서의 Firebase 활용: Firebase의 다양한 백엔드 서비스를 활용하여, 인증, 데이터베이스 관리, 함수, 스토리지 등을 관리하는 전체 스택 애플리케이션을 독립적으로 개발하였습니다. 이를 통해 빠른 프로토타이핑과 안정적인 서버리스 아키텍처를 기반으로 한 신속한 제품 출시를 실현했습니다.
    - 어드민 페이지 개발의 Next Auth 적용: Next Auth를 이용하여 강력한 인증 및 보안 메커니즘을 갖춘 관리자 페이지를 구축했습니다. 이 페이지는 관리자가 시스템 내 데이터를 안전하게 관리하고 모니터링할 수 있도록 필요한 모든 기능을 제공합니다.
    - Vercel을 통한 효율적인 배포 및 확장성: 애플리케이션은 Vercel 플랫폼을 통해 배포되었으며, 이는 높은 접근성과 누적된 트래픽에 대한 뛰어난 성능을 보장합니다. 또한, 자동화된 CI/CD 파이프라인을 통해 지속적인 업데이트와 최적화가 가능하도록 구성하였습니다.
    - 프로젝트 URL 제공: 제공된 "https://www.yakukhwa.com" 웹사이트를 통해, 이 축제 웹 애플리케이션은 실제 사용자들에게 문화적 이벤트와 정보를 효과적으로 전달하고, 참여와 상호작용의 기회를 제공합니다.
    `,
  },
];
