export const skillsData = [
  {
    id: 1,
    bio: `
    - HTML: 기본 태그 사용에 익숙하며, 웹 페이지의 구조를 설계할 수 있음.
    - CSS: 스타일링과 레이아웃 기본을 이해하며, 간단한 디자인 적용 가능.
    - Javascript: 기본적인 문법과 작동 원리를 이해하고, 간단한 상호작용을 구현할 수 있음.
    - Typescript: 기본적인 타입 사용에 익숙하며, Javascript에 타입 안정성을 추가할 수 있음.
    - ReactJS: 컴포넌트 기반 아키텍처를 이해하고, 상태 관리 및 기본적인 훅 사용에 익숙함.
    - NextJS: 기본적인 라우팅과 정적 생성에 대한 이해가 있으며, 간단한 프로젝트에 적용 가능.
    - Redux: 상태 관리의 기본 개념을 이해하고, 간단한 전역 상태 관리를 설정할 수 있음.
    - Recoil: React의 상태 관리에 대한 초보적 이해가 있으나, 실제 사용 경험은 제한적.
    - Bootstrap: 반응형 레이아웃과 기본 컴포넌트 사용법을 알고 있음.
    - Tailwind CSS: 유틸리티 클래스를 이용한 스타일링에 대한 기본적인 이해가 있음.
    - React Query: 백엔드와의 데이터 동기화에 대한 기본적인 이해가 있으나, 실무 경험은 적음.
    - React Hook Form: 양식 검증과 관리에 대해 알고 있으나, 다양한 케이스에서의 사용 경험은 아직 적음.`,
  },
];
